biddr_api/app/controllers/auctions_controller.rb

    def create
        action = Auction.new auction_params
        auction.user_id = current_user.id
        if auction.save
---
INSERT INTO "auctions" ("title", "description", "ends_at", "reserve_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]

    def index
        auctions = Auction.all.order(created_at: :desc)
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC