biddr_api/app/controllers/bids_controller.rb

INSERT INTO "bids" ("price", "user_id", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 500], ["user_id", 1], ["auction_id", 32], ["created_at", "2019-02-12 20:03:08.874675"], ["updated_at", "2019-02-12 20:03:08.874675"]]
---
    def create
        bid = Bid.new bid_params
        bid.user_id = current_user.id
        bid.auction_id = params[:auction_id]
        if bid.save